# GetSegPt2

## Description
Procedure GetSegPt2 returns the end point of the of the referenced line, wall, or linear dimension object.

```pascal
PROCEDURE GetSegPt2(
				h     : HANDLE;
				VAR p : REAL);
```

```python

def vs.GetSegPt2(h):
    return p
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to line.|
|p|REAL|Coordinates of end point.|

## Version
Availability: from MiniCAD
## Category
* Objects - 2D